tap "puma/puma"
tap "heroku/brew"

cask_args appdir: "/Applications", fontdir: "/Library/Fonts/"

brew "fish" # The best shell
brew "coreutils"
brew "readline"
brew "curl"
brew "wget"
brew "httpie"
brew "git"
brew "hub"
brew "ripgrep"
brew "fzf"
brew "bats"
brew "ctags"
brew "jq"   # JSON pretty-printer and processor
brew "tree" # Displays directories as trees in the terminal
brew "peco" # Interactive filtering tool. See: https://peco.github.io/#demo
brew "duti" # Helps select default applications for document types on OS X
brew "ag"
brew "mycli"
brew "htop"
brew "bat"
brew "fd"
brew "tldr"
brew "ncdu"

brew "rbenv"
brew "rbenv-default-gems"
brew "ruby-build"
brew "pyenv"
brew "ant"
cask "java"
brew "clojure"
brew "leiningen"
brew "go"
brew "typescript"
brew "node"
brew "yarn"
brew "elixir"
brew "elm"
brew "ghc"

brew "puma/puma/puma-dev"
brew "nginx"

brew "mysql"
brew "postgresql"

brew "get_iplayer"

cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "spotify"
cask "visual-studio-code"
cask "docker"
cask "dash"
cask "sketch"
cask "whatsapp"
cask "iterm2"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "day-o"
cask "quicklook-json"

cask "little-snitch"

# mas "Bear", id: 1091189122
# mas "Xcode", id: 497799835
# mas "1Password", id: 1333542190

tap "homebrew/cask-fonts"

cask "font-abril-fatface"
cask "font-arvo"
cask "font-archivo-black"
cask "font-archivo-narrow"
cask "font-bitter"
cask "font-cardo"
cask "font-cormorant"
cask "font-fira-sans"
cask "font-fira-code"
cask "font-fjalla-one"
cask "font-hack"
cask "font-karla"
cask "font-lato"
cask "font-lora"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-montserrat"
cask "font-nunito"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-playfair-display"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-slab"
cask "font-roboto-condensed"
cask "font-rubik"
#cask "font-signika"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-spectral"
